In [5]:
import pandas
pandas.__version__

'1.1.4'

In [6]:
import numpy as np
import pandas as pd

In [7]:
counts = pd.Series([636, 1658, 987, 112])
counts

0     636
1    1658
2     987
3     112
dtype: int64

In [8]:
counts.values

array([ 636, 1658,  987,  112])

In [9]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
bacteria = pd.Series([636, 1658, 987,112],
                     index=['Frmicutes', 'Proteobacteria', 'Actinobacteria', 'bacteroidetes'])
bacteria

Frmicutes          636
Proteobacteria    1658
Actinobacteria     987
bacteroidetes      112
dtype: int64

In [11]:
bacteria['Actinobacteria']

987

In [12]:
bacteria[0]

636

In [13]:
bacteria.name = 'counts'
bacteria.index.name = 'phylum'
bacteria

phylum
Frmicutes          636
Proteobacteria    1658
Actinobacteria     987
bacteroidetes      112
Name: counts, dtype: int64

In [14]:
np.log(bacteria)

phylum
Frmicutes         6.455199
Proteobacteria    7.413367
Actinobacteria    6.894670
bacteroidetes     4.718499
Name: counts, dtype: float64

In [15]:
bacteria[bacteria>1000]

phylum
Proteobacteria    1658
Name: counts, dtype: int64

In [16]:
bacteria[bacteria>500]

phylum
Frmicutes          636
Proteobacteria    1658
Actinobacteria     987
Name: counts, dtype: int64

In [17]:
bacteria[bacteria<100]

Series([], Name: counts, dtype: int64)

In [18]:
bacteria_dict = {'firmicutes': 632, 'proteobacteria':4576, 'actinobacteria':788, 'bacteriodetes': 456}
print(bacteria_dict)
pd.Series(bacteria_dict)

{'firmicutes': 632, 'proteobacteria': 4576, 'actinobacteria': 788, 'bacteriodetes': 456}

firmicutes         632
proteobacteria    4576
actinobacteria     788
bacteriodetes      456
dtype: int64

In [19]:
data = {"provinces":["FL", "FL", "NH", "NH", "ZH"],
        "year": [2013, 2014,2013, 2014, 2014],
        "literacy":[0.2, 0.1, 0.5, 0.4, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'provinces': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'year': [2013, 2014, 2013, 2014, 2014], 'literacy': [0.2, 0.1, 0.5, 0.4, 0.5]}

  provinces  year  literacy
0        FL  2013       0.2
1        FL  2014       0.1
2        NH  2013       0.5
3        NH  2014       0.4
4        ZH  2014       0.5

In [20]:
df = pd.DataFrame(data, columns=["year", "provinces", "literacy"])
df

   year provinces  literacy
0  2013        FL       0.2
1  2014        FL       0.1
2  2013        NH       0.5
3  2014        NH       0.4
4  2014        ZH       0.5

In [21]:
df['nonsense'] = df.year /df.literacy
df

   year provinces  literacy  nonsense
0  2013        FL       0.2   10065.0
1  2014        FL       0.1   20140.0
2  2013        NH       0.5    4026.0
3  2014        NH       0.4    5035.0
4  2014        ZH       0.5    4028.0

In [22]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2,3,4])
df

   year provinces  literacy  nonsense  Serie_aligned
0  2013        FL       0.2   10065.0              0
1  2014        FL       0.1   20140.0              1
2  2013        NH       0.5    4026.0              2
3  2014        NH       0.4    5035.0              3
4  2014        ZH       0.5    4028.0              4

In [23]:
df.to_dict()

{'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4},
 'literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.4, 4: 0.5},
 'nonsense': {0: 10065.0, 1: 20140.0, 2: 4026.0, 3: 5035.0, 4: 4028.0},
 'provinces': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014}}

In [24]:
pd.DataFrame(df.to_dict())

   year provinces  literacy  nonsense  Serie_aligned
0  2013        FL       0.2   10065.0              0
1  2014        FL       0.1   20140.0              1
2  2013        NH       0.5    4026.0              2
3  2014        NH       0.4    5035.0              3
4  2014        ZH       0.5    4028.0              4

In [25]:
data = [{'a':i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [26]:
pd.DataFrame([{'aa': 5, 'bb': 2},{'bb': 5, 'cc': 7}])

    aa  bb   cc
0  5.0   2  NaN
1  NaN   5  7.0

In [27]:
pd.DataFrame(np.random.randint(2, 12),
             columns=['foo', 'bar'],
             index=['a', 'b', 'c'])

   foo  bar
a   10   10
b   10   10
c   10   10

In [28]:
ind = pd.Index([20, 34, 57, 7, 1, 8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [29]:
ind[1]

34

In [30]:
ind[::]

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [31]:
ind[1: 4:]

Int64Index([34, 57, 7], dtype='int64')

In [32]:
ind[1: 3:]

Int64Index([34, 57], dtype='int64')

In [33]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [34]:
ind[1]

34

In [35]:
rng = np.random.RandomState(16)
ser = pd.Series(rng.randint(0, 10, 5))
ser

0    9
1    9
2    5
3    1
4    4
dtype: int64

In [36]:
dfr = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                   columns=['A','B', 'c', 'D'])
dfr

   A  B  c  D
0  4  9  0  0
1  8  2  4  0
2  1  2  4  0

In [37]:
np.exp(ser)

0    8103.083928
1    8103.083928
2     148.413159
3       2.718282
4      54.598150
dtype: float64

In [38]:
np.sin(dfr * np.pi / 4)

              A         B             c    D
0  1.224647e-16  0.707107  0.000000e+00  0.0
1 -2.449294e-16  1.000000  1.224647e-16  0.0
2  7.071068e-01  1.000000  1.224647e-16  0.0

In [39]:
area = pd.Series({'alaska': 1723337, 'texas': 5668678, 
                  'california':6578789},name='area')
population = pd.Series({'alaska':45678956, 'california':5678903, 'texas':456878675},name='population')
print(area)
population

alaska        1723337
texas         5668678
california    6578789
Name: area, dtype: int64

alaska         45678956
california      5678903
texas         456878675
Name: population, dtype: int64

In [40]:
population / area

alaska        26.506108
california     0.863214
texas         80.597041
dtype: float64

In [41]:
area.index | population.index

Index(['alaska', 'california', 'texas'], dtype='object')

In [42]:
A = pd.Series([2, 3, 6], index=[0,1,2])
B = pd.Series([1, 3, 7], index=[1,3,5])
print(A)
print(B)
B
A + B

0    2
1    3
2    6
dtype: int64
1    1
3    3
5    7
dtype: int64

0    NaN
1    4.0
2    NaN
3    NaN
5    NaN
dtype: float64

In [43]:
A.add(B, fill_value=0)

0    2.0
1    4.0
2    6.0
3    3.0
5    7.0
dtype: float64

In [44]:
df

   year provinces  literacy  nonsense  Serie_aligned
0  2013        FL       0.2   10065.0              0
1  2014        FL       0.1   20140.0              1
2  2013        NH       0.5    4026.0              2
3  2014        NH       0.4    5035.0              3
4  2014        ZH       0.5    4028.0              4

In [45]:
df2 = pd.DataFrame({"provinces": ["FL", "NH", "ZH"], "population": ["132489", "234567", "677889"]})
df2

  provinces population
0        FL     132489
1        NH     234567
2        ZH     677889

In [46]:
df.merge(df2)

   year provinces  literacy  nonsense  Serie_aligned population
0  2013        FL       0.2   10065.0              0     132489
1  2014        FL       0.1   20140.0              1     132489
2  2013        NH       0.5    4026.0              2     234567
3  2014        NH       0.4    5035.0              3     234567
4  2014        ZH       0.5    4028.0              4     677889

In [47]:
df3 = pd.DataFrame({"provinces": ["FL" , "NH"], "population": ["56789", "67879"]})
df3
df.merge(df3, right_on='provinces', left_on='provinces')

   year provinces  literacy  nonsense  Serie_aligned population
0  2013        FL       0.2   10065.0              0      56789
1  2014        FL       0.1   20140.0              1      56789
2  2013        NH       0.5    4026.0              2      67879
3  2014        NH       0.4    5035.0              3      67879

In [48]:
df4 = pd.DataFrame({"provinces": ["FL" , "NH" ,"UT"] , "population": ["12345", "456787","547689"]})
df.merge(df4, how='outer')

     year provinces  literacy  nonsense  Serie_aligned population
0  2013.0        FL       0.2   10065.0            0.0      12345
1  2014.0        FL       0.1   20140.0            1.0      12345
2  2013.0        NH       0.5    4026.0            2.0     456787
3  2014.0        NH       0.4    5035.0            3.0     456787
4  2014.0        ZH       0.5    4028.0            4.0        NaN
5     NaN        UT       NaN       NaN            NaN     547689

In [50]:
df5 = pd.DataFrame({"provinces": ["FL", "NH", "FL"], "population": ["18978", "46531", "566799"]})
print(df)
df.merge(df5, how='outer')

   year provinces  literacy  nonsense  Serie_aligned
0  2013        FL       0.2   10065.0              0
1  2014        FL       0.1   20140.0              1
2  2013        NH       0.5    4026.0              2
3  2014        NH       0.4    5035.0              3
4  2014        ZH       0.5    4028.0              4

   year provinces  literacy  nonsense  Serie_aligned population
0  2013        FL       0.2   10065.0              0      18978
1  2013        FL       0.2   10065.0              0     566799
2  2014        FL       0.1   20140.0              1      18978
3  2014        FL       0.1   20140.0              1     566799
4  2013        NH       0.5    4026.0              2      46531
5  2014        NH       0.4    5035.0              3      46531
6  2014        ZH       0.5    4028.0              4        NaN

In [52]:
serie_a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
                    index=['f', 'e', 'd', 'c','b','a'])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                    index=['f','e','d','c','d','a'])

In [59]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [60]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
d    4.0
a    5.0
dtype: float64

In [63]:
pd.Series(np.where(pd.isnull(serie_a), serie_b,serie_a), index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [81]:
serie_a.combine_first(serie_a)

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64